case_interPhaseChangeFoam_waxman_turb/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0); 
    }
    /*
    was:
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    */
    walls
    {
        type            noSlip;
    }
    side1
    {
        type            wedge;
    }
    side2
    {
        type            wedge;
    }
}


// ************************************************************************* //
