case_interPhaseChangeFoam_waxman_turb/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          70;
        startFace       49170;
    }
    outlet
    {
        type            patch;
        nFaces          70;
        startFace       49240;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          820;
        startFace       49310;
    }
    side1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          25000;
        startFace       50130;
    }
    side2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          25000;
        startFace       75130;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       100130;
    }
)

// ************************************************************************* //
